       01 REG-ORCAMENTO.
           05 ORC-CODIGO            PIC 9(06).
           05 ORC-DESCRICAO         PIC X(40).
           05 ORC-VALOR-TOTAL       PIC 9(09)V99.
           05 ORC-STATUS            PIC X(01).
           05 FILLER                PIC X(22).